clc;   close all;   clear all;

%============ Μέρος 1 =====================================================

%(1.1)---------------------------------------------------------------------
% Πεδίο ορισμού λεκτικής μεταβλητής x=<<υγρασία>>
lower_limit=0; 
upper_limit=100; 
step_size=1; 
x=lower_limit:step_size:upper_limit;

%(1.2)---------------------------------------------------------------------
% Ζεύγη singleton των τριών ασαφών συνόλων
mf(1,:)= 1./(1+(x/15).^2); % Α=<<χαμηλή>>
mf(2,:)=exp(-0.5*((x-50).^2)/(10.^2)); % Β=<<μέση>>
mf(3,:)=1./(1+((x-100)/18).^2); % C=<<υψηλή>>

%(1.3)---------------------------------------------------------------------
%(1.3.1)
% Σύνολα υποστήριξης με όριο το 0.005
z1=find(mf(1,:)>0.005); 
z2=find(mf(2,:)>0.005); 
z3=find(mf(3,:)>0.005);

% Αναπαράσταση των τριών γραφημάτων σε μία γραμμή και σε 3 στήλες στην ίδια
% εικόνα(figure)
figure(1)
subplot(1,3,1) % 1η γραμμη, 1η στήλη
kk1=mf(1,z1); 
bar(x(z1),kk1,0.1); % Ραβδόγραμμα πάχους 0.1
title('Χαμηλή')

subplot(1,3,2) % 1η γραμμή, 2η στήλη
kk2=mf(2,z2);
bar(x(z2),kk2,0.1); % Ραβδόγραμμα πάχους 0.1
title('Μέση')

subplot(1,3,3) % 1η γραμμή, 3η στήλη
kk3=mf(3,z3); 
bar(x(z3),kk3,0.1); % Ραβδόγραμμα πάχους 0.1
title('Υψηλή')

% Πυρήνες με όριο το 0.95
z4=find(mf(1,:)>0.95); 
z5=find(mf(2,:)>0.95); 
z6=find(mf(3,:)>0.95);

figure(2)
subplot(1,3,1) % 1η γραμμη, 1η στήλη
kk4=mf(1,z4);
bar(x(z4),kk4,0.1); % Ραβδόγραμμα πάχους 0.1
title('Χαμηλή')

subplot(1,3,2) % 1η γραμμή, 2η στήλη
kk5=mf(2,z5); 
bar(x(z5),kk5,0.1); % Ραβδόγραμμα πάχους 0.1
title('Μέση')

subplot(1,3,3) % 1η γραμμή, 3η στήλη
kk6=mf(3,z6); 
bar(x(z6),kk6,0.1); % Ραβδόγραμμα πάχους 0.1
title('Υψηλή')


%(1.4)---------------------------------------------------------------------
%Απεικόνιση των ζευγών Singleton των τριών ασαφών συνόλων
figure(3) 
plot(x,mf(1,:),'b',x,mf(2,:),'r',x,mf(3,:),'g' , 'LineWidth',1);
title('Ζεύγη Singleton' );
legend('Χαμηλή','Mέση','Yψηλή' )

%(1.5)---------------------------------------------------------------------
%(1.5.1)-Τομή ασαφών συνόλων
% Τομή συνόλων A,C
figure(4)
In_A_C=min(mf(1,:),mf(3,:));
plot(x,In_A_C,'b','LineWidth',1);
title(' Τομή  <<χαμηλής>>  και  <<υψηλής>> ')
axis([min(x) max(x) 0 max(In_A_C)]);% Καθορισμός ορίων αξόνων. Η τεταγμένη να ανέρχεται στη μέγιστη τιμή της τομής.

% Τομή συνόλων C,B
figure(5)
In_C_B=min(mf(3,:),mf(2,:));
plot(x,In_C_B,'r','LineWidth',1);
title( ' Τομή  <<υψηλής>>  και  <<μέσης>> ')
axis([min(x) max(x) 0 max(In_C_B)]);% Καθορισμός ορίων αξόνων. Η τεταγμένη να ανέρχεται στη μέγιστη τιμή της τομής.

%(1.5.2)-Ένωση ασαφών συνόλων  
% Ένωση συνόλων A,B 
figure(6)
Un_A_B=max(mf(1,:),mf(2,:));
plot(x,Un_A_B,'g','LineWidth',1);
title(' Ένωση  <<χαμηλής>>  και  <<μέσης>> ');
axis([min(x) max(x) 0 max(Un_A_B)]); % Καθορισμός ορίων αξόνων. Η τεταγμένη να ανέρχεται στη μέγιστη τιμή της ένωσης

% Ένωση συνόλων A,C
figure(7)
Un_A_C=max(mf(1,:),mf(3,:));
plot(x,Un_A_C, 'c','LineWidth',1);
title(' Ένωση  <<χαμηλής>>  και  <<υψηλής>> ');
axis([min(x) max(x) 0 max(Un_A_C)]); % Καθορισμός ορίων αξόνων. Η τεταγμένη να ανέρχεται στη μέγιστη τιμή της ένωσης.

%(1.5.3)-Συμπλήρωμα ασαφούς συνόλου Α
figure(8)
mf_A_bar=1-mf(1,:);
plot(x,mf(1,:),'b',x,mf_A_bar,'r--');
title('Συμπλήρωμα ασαφούς συνόλου Α');
legend('Σύνολο Α','Συμπλήρωμα του Α','Location','east')
axis([min(x) max(x) 0 1.1]); % Καθορισμός ορίων αξόνων.

%(1.6)---------------------------------------------------------------------
% Mέγεθος ασαφών συνόλων
 for i=1:3
   cardinal=sum(mf(i,:));
   st=sprintf('Το μέγεθος του ασαφούς συνόλου αριθμού %d είναι %g\n',i,cardinal);
   disp(st);
 end

 % Μέγεθος τομής συνόλων Α,C
 cardinal=sum(In_A_C);
 st1=sprintf('To μέγεθος της τομής των A,C είναι %g\n',cardinal);
 disp(st1);

 % Μέγεθος τομής συνόλων C,B
 cardinal=sum(In_C_B);
 st2=sprintf('To μέγεθος της τομής των C,B είναι %g\n',cardinal);
 disp(st2);

 % Μέγεθος ένωσης συνόλων Α,B
 cardinal=sum(Un_A_B);
 st3=sprintf('To μέγεθος της ένωσης των A,Β είναι %g\n',cardinal);
 disp(st3);

 % Μέγεθος ένωσης συνόλων Α,C
 cardinal=sum(Un_A_C);
 st4=sprintf('To μέγεθος της ένωσης των A,C είναι %g\n',cardinal);
 disp(st4);


%============ Μέρος 2 =====================================================

%(2.1)---------------------------------------------------------------------
% Πεδία ορισμόυ των Ux και Uy
Ux=linspace(0,50,1001);
Uy=linspace(0,100,1001);

%(2.2)---------------------------------------------------------------------
% Τιμές παραμέτρων της τριγωνικής συνάρτησης συμμετοχής με βάση τους
% περιορισμούς της tri_MF
x=0:100;
a1=10;
b1=20;
c1=30;
mf_1=tri_MF(x,a1,b1,c1); % Συνάρτηση συμμετοχής tri_MF
figure(9)
plot(x,mf_1,'b','LineWidth',1) 
title('Tριγωνική Συνάρτηση Συμμετοχής')

% Τιμές παραμέτρων της τραπεζοειδής συνάρτησης συμμετοχής με βάση τους
% περιορισμούς της trap_MF
a2=15;
b2=30;
c2=45;
d=60;
mf_2=trap_MF(x,a2,b2,c2,d); % Συνάρτηση συμμετοχής trap_MF
figure(10)
plot(x,mf_2,'r','LineWidth',1)
title('Τραπεζοειδής Συνάρτηση Συμμετοχής')

% Τιμές παραμέτρων της γκαουσιανής συνάρτησης συμμετοχής με βάση τους
% περιορισμούς της gauss_MF
m=50;
sigma=10;
mf_3=gauss_MF(x,m,sigma); % Συνάρτηση συμμετοχής gauss_MF
figure(11)
plot(x,mf_3,'m','LineWidth',1)
title('Γκαουσιανή Συνάρτηση Συμμετοχής')

%(2.3)---------------------------------------------------------------------
% Προσέγγιση ασαφών συνόλων με χρήση γκαουσιανών συναρτήσεων συμμετοχής
% Α=<<χαμηλή>>. Μέση τιμή στο 0 και σίγμα=16
m_1=0; 
sigma_1=16;
Gauss_A=gauss_MF(x,m_1,sigma_1);

% Β=<<μέση>>. Έτοιμη γκαουσιανή απο εκφώνηση
m_2=50;
sigma_2=10;
Gauss_B=gauss_MF(x,m_2,sigma_2);

% C=<<υψηλή>>. Μέση τιμη στο 100 και σίγμα=19
m_3=100;
sigma_3=19;
Gauss_C=gauss_MF(x,m_3,sigma_3);

figure(12)
plot(x,Gauss_A,'b',x,Gauss_B,'r',x,Gauss_C,'g','LineWidth',1);
title('Προσέγγιση ασαφών συνόλων με χρήση γκαουσιανών');
legend('Χαμηλή','Μέση','Υψηλή')
 

%(2.4)---------------------------------------------------------------------
% Τιμές των ορισμάτων
x=Ux;
y=Uy;
mx=20;
my=60;
sx=8;
sy=15;
% Δισδιάστατη συνάρτηση συμμετοχής my_fun
MF_A=my_fun(x,y,sx,sy,mx,my);
figure(13)
mesh(x,y,MF_A);
title('Δισδιάστατη Συνάρτηση Συμμετοχής');
xlabel('x'); ylabel('y')
